Revit 2026 API

# IRebarUpdateServerGetCustomHandles Method

---

This function should define all handles that the Rebar has. This function is called when the Rebar is created.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool GetCustomHandles(
	RebarHandlesData handlesInfoData
)
```
```vb
Function GetCustomHandles (
	handlesInfoData As RebarHandlesData
) As Boolean
```
```cpp
bool GetCustomHandles(
	RebarHandlesData^ handlesInfoData
)
```
```fsharp
abstract GetCustomHandles :
        handlesInfoData : RebarHandlesData -> bool
```

#### Parameters

handlesInfoData RebarHandlesData
     Use the methods on this class to define the handles for the free form rebar. Revit will use these handles to create appropriate RebarConstraints.

#### Return Value

Boolean Returns true if the handles were defined successfully, false otherwise.

Revit consider the execution failed if we have duplicate tags for custom, start and end handles.

#### Reference

IRebarUpdateServer Interface

Autodesk.Revit.DB.Structure Namespace